In [8]:
import pandas as pd
#series는 데이터가 나열된 리스트라 볼 수 있음
#series가 모여서 엑셀과 같은 테이블 형태의 데이터 프레임이 됨.
s1 = pd.Series({
    '김': 100,
    '나': 200,
    '박': 141,
    '이': 124
})
s1.name = "수학"  #리스트의 이름을 지어주는 거임.
print(s1)

s2 = pd.Series({
    '김': 30,
    '나': 5,
    '박': 1141,
    '이': 124
})
print(s2)

s3 = pd.Series([8,3,13,2])
s3.name = '국어'
print(s3)

s4 = pd.Series([30,5,1234,141])
print(s4)

김    100
나    200
박    141
이    124
Name: 수학, dtype: int64
김      30
나       5
박    1141
이     124
dtype: int64
0     8
1     3
2    13
3     2
Name: 국어, dtype: int64
0      30
1       5
2    1234
3     141
Name: 국어, dtype: int64

pandas ->  자주 사용하고 유용한 기능을 구현해 둔 코드 집합체 
           파이썬으로 마치 프로그래밍 버전의 엑셀을 다루듯 고성능 데이터 구조를 만들 
           수 있는 유명 라이브러리  
  
pandas VS excel -> 엑셀은 최종 데이터를 정리, 관리하는  용
                   판다스는 raw데이터를 정제하는 용/ 데이터 분석을 쉽게 하여 엑셀파일
                                                     이 만들어지도록 함

# 데이터 프레임

In [14]:
df = pd. DataFrame({
    '출생지':['한국','미국'],
    '나이' : [20, 30]
})

print(df)
df #그냥 df라고 입력해도 나옴

  출생지  나이
0  한국  20
1  미국  30

  출생지  나이
0  한국  20
1  미국  30

In [15]:
df['성별'] = ['여자', '남자']  # 열 추가하기
df

  출생지  나이  성별
0  한국  20  여자
1  미국  30  남자

In [17]:
df.loc[2] = ['일본', 25, '여'] # 행 추가하기
df

  출생지  나이  성별
0  한국  20  여자
1  미국  30  남자
2  일본  25   여

In [22]:
#데이터 프레임을 Series로 구성하는 법
df2 = pd.DataFrame(s1)
df2['영어'] = s2  #영어라는 열 출가하고 그 아래에 s2의 값 추가함
df2['미술'] = [1,2,3,4]

df2

    수학    영어  미술
김  100    30   1
나  200     5   2
박  141  1141   3
이  124   124   4

In [24]:
df2[['수학','미술']]

    수학  미술
김  100   1
나  200   2
박  141   3
이  124   4

In [ ]:
df2.loc